In [2]:
import pandas as pd
import sqlalchemy

In [7]:
engine = sqlalchemy.create_engine('mysql+pymysql://root:Dheeraj789%@localhost:3306/login')

In [9]:
df = pd.read_sql_table("employee",engine,columns=['name','tech'])
df

       name       tech
0   dheeraj       java
1  harbilas    android
2  gurinder   big data
3      aman    editing
4    vikram  geography

In [11]:
query = 'select  employee.name,employee.tech,orders.order  from login.employee inner join orders on employee.id = orders.id'
newdf = pd.read_sql_query(query,engine)
newdf

       name       tech   order
0   dheeraj       java  mobile
1  harbilas    android  laptop
2  gurinder   big data     mac
3      aman    editing  mobile
4    vikram  geography     map

In [12]:
customer_data = pd.read_csv("SampleOrder.csv")
customer_data

  customer name       customer order
0         trump  million dollar cash
1          modi              vaccine
2         putin             grenades
3      kim jong             missiles

In [15]:
customer_data.rename(columns={
    'customer name':'name',
    'customer order':'order'
},inplace = True)
customer_data

       name                order
0     trump  million dollar cash
1      modi              vaccine
2     putin             grenades
3  kim jong             missiles

In [20]:
customer_data.to_sql('orders',engine,if_exists='replace')